module.exports = {
  elec: {
    campus: {
      '本部芙蓉区': {
        num: '01',
        buildings: {
          '芙蓉一': {
            num: '01'
          },
          '芙蓉二': {
            num: '02'
          },
          '芙蓉三': {
            num: '03'
          },
          '芙蓉四': {
            num: '04'
          },
          '芙蓉五': {
            num: '05'
          },
          '芙蓉六': {
            num: '06'
          },
          '芙蓉十': {
            num: '07'
          },
          '芙蓉十三': {
            num: '08'
          },
          '芙蓉七': {
            num: '09'
          },
          '芙蓉八': {
            num: '10'
          },
          '芙蓉九': {
            num: '11'
          },
          '芙蓉12': {
            num: '12'
          },
          '芙蓉11': {
            num: '13'
          }
        }
      },
      '本部石井区': {
        num: '02'
      },
      '本部南光区': {
        num: '03'
      },
      '本部凌云区': {
        num: '04'
      },
      '本部勤业区': {
        num: '05'
      },
      '本部海滨新区': {
        num: '06'
      },
      '本部丰庭区': {
        num: '07'
      },
      '漳州校区芙蓉园': {
        num: '26'
      },
      '海韵学生公寓': {
        num: '08'
      },
      '曾厝垵学生公寓': {
        num: '09'
      },
      '漳州校区博学园': {
        num: '21'
      },
      '漳州校区囊萤园': {
        num: '22'
      },
      '漳州校区笃行园': {
        num: '23'
      },
      '漳州校区映雪园': {
        num: '24'
      },
      '漳州校区勤业园': {
        num: '25'
      },
      '漳州校区若谷园': {
        num: '27'
      },
      '漳州校区凌云园': {
        num: '28'
      },
      '漳州校区丰庭园': {
        num: '29'
      },
      '漳州校区南安园': {
        num: '30'
      },
      '漳州校区南光园': {
        num: '31'
      },
      '漳州校区嘉庚若谷园': {
        num: '32'
      },
      '翔安校区芙蓉区': {
        num: '33'
      },
      '翔安校区南安区': {
        num: '34'
      },
      '翔安校区南光区': {
        num: '35'
      },
      '翔安国光区': {
        num: '42'
      },
      '翔安丰庭区': {
        num: '41'
      },
      '翔安笃行区': {
        num: '40'
      },
      '思明校区留学生区': {
        num: '10'
      },
      '翔安三期H区': {
        num: '11'
      },
      '翔安三期K区': {
        num: '12'
      },
      '翔安校区博学区': {
        num: '50'
      },
      '翔安校区凌云区': {
        num: '51'
      },
      '翔安校区映雪区': {
        num: '52'
      }
    },
    note: [
      '8位房间编码组成：第1、2位为校区号（见校区编号对应表）；\
      第3、4位是宿舍编号（见宿舍编号对应表）；\
      第5、6位是楼层号；\
      第7、8位是房号；',
      '例： 宿舍为校本部芙蓉一 316房间，宿舍房间编码为：01010316；\
      宿舍为校本部海滨新区三号楼 316房间，宿舍房间编码为：06160316\
      宿舍为漳州校区芙蓉1-316房间，宿舍房间编码为：26010316；\
      宿舍为漳州校区若谷2-316房间，宿舍房间编码为：27020316'
    ]
  }
};